In [58]:
import pandas as pd
import numpy as np

In [5]:
oil = pd.read_csv('oil.csv')
oil

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [6]:
oil.shape

(1218, 2)

In [7]:
oil.index

RangeIndex(start=0, stop=1218, step=1)

In [8]:
oil.columns

Index(['date', 'dcoilwtico'], dtype='object')

In [9]:
oil.columns = ['price_date', 'oil_price']
oil

      price_date  oil_price
0     2013-01-01        NaN
1     2013-01-02      93.14
2     2013-01-03      92.97
3     2013-01-04      93.12
4     2013-01-07      93.20
...          ...        ...
1213  2017-08-25      47.65
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26

[1218 rows x 2 columns]

In [10]:
oil.axes

[RangeIndex(start=0, stop=1218, step=1),
 Index(['price_date', 'oil_price'], dtype='object')]

In [11]:
oil.dtypes

price_date     object
oil_price     float64
dtype: object

In [12]:
oil.head()

   price_date  oil_price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20

In [13]:
oil.tail()

      price_date  oil_price
1213  2017-08-25      47.65
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26

In [17]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price_date  1218 non-null   object
 1   oil_price   1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [16]:
oil.sample(5)

      price_date  oil_price
214   2013-10-28      98.74
235   2013-11-26      93.41
657   2015-07-09      52.76
1133  2017-05-05      46.23
792   2016-01-14      31.22

In [20]:
oil.describe(include='all')

        price_date    oil_price
count         1218  1175.000000
unique        1218          NaN
top     2013-01-01          NaN
freq             1          NaN
mean           NaN    67.714366
std            NaN    25.630476
min            NaN    26.190000
25%            NaN    46.405000
50%            NaN    53.190000
75%            NaN    95.660000
max            NaN   110.620000

In [31]:
oil.duplicated(subset='price').sum()

219

In [34]:
oil.drop_duplicates(subset=["price"], ignore_index=True)

           date  price  euro_price
0    2013-01-01    NaN         NaN
1    2013-01-02  93.14     102.454
2    2013-01-03  92.97     102.267
3    2013-01-04  93.12     102.432
4    2013-01-07  93.20     102.520
..          ...    ...         ...
994  2017-08-15  47.57      52.327
995  2017-08-18  48.59      53.449
996  2017-08-21  47.39      52.129
997  2017-08-30  45.96      50.556
998  2017-08-31  47.26      51.986

[999 rows x 3 columns]

In [35]:
oil

            date  price  euro_price
0     2013-01-01    NaN         NaN
1     2013-01-02  93.14     102.454
2     2013-01-03  92.97     102.267
3     2013-01-04  93.12     102.432
4     2013-01-07  93.20     102.520
...          ...    ...         ...
1213  2017-08-25  47.65      52.415
1214  2017-08-28  46.40      51.040
1215  2017-08-29  46.46      51.106
1216  2017-08-30  45.96      50.556
1217  2017-08-31  47.26      51.986

[1218 rows x 3 columns]

In [39]:
oil.loc[oil['price'] > 100]

           date   price  euro_price
131  2013-07-03  101.92     112.112
133  2013-07-05  103.09     113.399
134  2013-07-08  103.03     113.333
135  2013-07-09  103.46     113.806
136  2013-07-10  106.41     117.051
..          ...     ...         ...
407  2014-07-24  102.76     113.036
408  2014-07-25  105.23     115.753
409  2014-07-28  105.68     116.248
410  2014-07-29  104.91     115.401
411  2014-07-30  104.29     114.719

[182 rows x 3 columns]

# sort

In [44]:
oil.sort_index(ascending=True, axis=1)

            date  euro_price  price
0     2013-01-01         NaN    NaN
1     2013-01-02     102.454  93.14
2     2013-01-03     102.267  92.97
3     2013-01-04     102.432  93.12
4     2013-01-07     102.520  93.20
...          ...         ...    ...
1213  2017-08-25      52.415  47.65
1214  2017-08-28      51.040  46.40
1215  2017-08-29      51.106  46.46
1216  2017-08-30      50.556  45.96
1217  2017-08-31      51.986  47.26

[1218 rows x 3 columns]

In [50]:
oil['month'] = oil['date']
oil

            date  price  euro_price       month
0     2013-01-01    NaN         NaN  2013-01-01
1     2013-01-02  93.14     102.454  2013-01-02
2     2013-01-03  92.97     102.267  2013-01-03
3     2013-01-04  93.12     102.432  2013-01-04
4     2013-01-07  93.20     102.520  2013-01-07
...          ...    ...         ...         ...
1213  2017-08-25  47.65      52.415  2017-08-25
1214  2017-08-28  46.40      51.040  2017-08-28
1215  2017-08-29  46.46      51.106  2017-08-29
1216  2017-08-30  45.96      50.556  2017-08-30
1217  2017-08-31  47.26      51.986  2017-08-31

[1218 rows x 4 columns]

In [52]:
oil.sort_values('date', ascending=False)

            date  price  euro_price       month
1217  2017-08-31  47.26      51.986  2017-08-31
1216  2017-08-30  45.96      50.556  2017-08-30
1215  2017-08-29  46.46      51.106  2017-08-29
1214  2017-08-28  46.40      51.040  2017-08-28
1213  2017-08-25  47.65      52.415  2017-08-25
...          ...    ...         ...         ...
4     2013-01-07  93.20     102.520  2013-01-07
3     2013-01-04  93.12     102.432  2013-01-04
2     2013-01-03  92.97     102.267  2013-01-03
1     2013-01-02  93.14     102.454  2013-01-02
0     2013-01-01    NaN         NaN  2013-01-01

[1218 rows x 4 columns]

In [53]:
oil

            date  price  euro_price       month
0     2013-01-01    NaN         NaN  2013-01-01
1     2013-01-02  93.14     102.454  2013-01-02
2     2013-01-03  92.97     102.267  2013-01-03
3     2013-01-04  93.12     102.432  2013-01-04
4     2013-01-07  93.20     102.520  2013-01-07
...          ...    ...         ...         ...
1213  2017-08-25  47.65      52.415  2017-08-25
1214  2017-08-28  46.40      51.040  2017-08-28
1215  2017-08-29  46.46      51.106  2017-08-29
1216  2017-08-30  45.96      50.556  2017-08-30
1217  2017-08-31  47.26      51.986  2017-08-31

[1218 rows x 4 columns]

In [56]:
oil

            date  price  euro_price       month
0     2013-01-01    NaN         NaN  2013-01-01
1     2013-01-02  93.14     102.454  2013-01-02
2     2013-01-03  92.97     102.267  2013-01-03
3     2013-01-04  93.12     102.432  2013-01-04
4     2013-01-07  93.20     102.520  2013-01-07
...          ...    ...         ...         ...
1213  2017-08-25  47.65      52.415  2017-08-25
1214  2017-08-28  46.40      51.040  2017-08-28
1215  2017-08-29  46.46      51.106  2017-08-29
1216  2017-08-30  45.96      50.556  2017-08-30
1217  2017-08-31  47.26      51.986  2017-08-31

[1218 rows x 4 columns]

In [60]:
oil['buy'] = np.where(oil['price']> 100, 'Too High', 'Buy')
oil

            date  price  euro_price       month  buy
0     2013-01-01    NaN         NaN  2013-01-01  Buy
1     2013-01-02  93.14     102.454  2013-01-02  Buy
2     2013-01-03  92.97     102.267  2013-01-03  Buy
3     2013-01-04  93.12     102.432  2013-01-04  Buy
4     2013-01-07  93.20     102.520  2013-01-07  Buy
...          ...    ...         ...         ...  ...
1213  2017-08-25  47.65      52.415  2017-08-25  Buy
1214  2017-08-28  46.40      51.040  2017-08-28  Buy
1215  2017-08-29  46.46      51.106  2017-08-29  Buy
1216  2017-08-30  45.96      50.556  2017-08-30  Buy
1217  2017-08-31  47.26      51.986  2017-08-31  Buy

[1218 rows x 5 columns]

In [64]:
conditions = [
    (oil['price'] > 100),
    (oil['price'] <= 100) % (oil['price'] > 50),
    (oil['price'] <= 50)
]
choices = ["don't buy", "Buy", "strong Buy"]
oil['Buy'] = np.select(conditions, choices, default="Missing")
oil.head()

TypeError: invalid entry 1 in condlist: should be boolean ndarray

In [67]:
retail = pd.read_csv('retail.csv')
retail.head()

        id        date  store_nbr      family  sales  onpromotion
0  1945944  2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945945  2016-01-01          1   BABY CARE    0.0            0
2  1945946  2016-01-01          1      BEAUTY    0.0            0
3  1945947  2016-01-01          1   BEVERAGES    0.0            0
4  1945948  2016-01-01          1       BOOKS    0.0            0

In [68]:
retail.loc[:, 'family'].value_counts()

family
AUTOMOTIVE                    31968
HOME APPLIANCES               31968
SCHOOL AND OFFICE SUPPLIES    31968
PRODUCE                       31968
PREPARED FOODS                31968
POULTRY                       31968
PLAYERS AND ELECTRONICS       31968
PET SUPPLIES                  31968
PERSONAL CARE                 31968
MEATS                         31968
MAGAZINES                     31968
LIQUOR,WINE,BEER              31968
LINGERIE                      31968
LAWN AND GARDEN               31968
LADIESWEAR                    31968
HOME CARE                     31968
HOME AND KITCHEN II           31968
BABY CARE                     31968
HOME AND KITCHEN I            31968
HARDWARE                      31968
GROCERY II                    31968
GROCERY I                     31968
FROZEN FOODS                  31968
EGGS                          31968
DELI                          31968
DAIRY                         31968
CLEANING                      31968
CELEBRATION                   31968
BREAD/BAKERY                  31968
BOOKS                         31968
BEVERAGES                     31968
BEAUTY                        31968
SEAFOOD                       31968
Name: count, dtype: int64

In [69]:
product_category_dict = {
    'PRODUCE': 'Grocery',
    'POULTRY': 'Grocery',
}

In [70]:
retail.loc[:, 'family'].map(product_category_dict).value_counts(dropna=False)

family
NaN        991008
Grocery     63936
Name: count, dtype: int64

# Assign

In [71]:
retail

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [75]:
retail.assign(
    onpromotion_flag = retail['onpromotion'] > 0,
    family_abbrev = retail['family'].str[:3],
    onpromotion_ratio = retail['sales'] / retail['onpromotion'],
    sales_onprom_target = lambda x: x['onpromotion_ratio'] > 100
).query('sales_onprom_target == True')

,id,date,store_nbr,family,sales,onpromotion,onpromotion_flag,family_abbrev,onpromotion_ratio,sales_onprom_target
561,1946505,2016-01-01,25,AUTOMOTIVE,4.000,0,False,AUT,inf,True
563,1946507,2016-01-01,25,BEAUTY,13.000,0,False,BEA,inf,True
564,1946508,2016-01-01,25,BEVERAGES,5104.000,1,True,BEV,5104.000,True
566,1946510,2016-01-01,25,BREAD/BAKERY,680.952,0,False,BRE,inf,True
567,1946511,2016-01-01,25,CELEBRATION,13.000,0,False,CEL,inf,True
...,...,...,...,...,...,...,...,...,...,...
1054937,3000881,2017-08-15,9,PET SUPPLIES,6.000,0,False,PET,inf,True
1054938,3000882,2017-08-15,9,PLAYERS AND ELECTRONICS,6.000,0,False,PLA,inf,True
1054939,3000883,2017-08-15,9,POULTRY,438.133,0,False,POU,inf,True
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1,True,PRE,154.553,True
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0,False,SEA,inf,True

In [76]:
retail.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054944 entries, 0 to 1054943
Data columns (total 6 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1054944 non-null  int64
 1   date         1054944 non-null  object
 2   store_nbr    1054944 non-null  int64
 3   family       1054944 non-null  object
 4   sales        1054944 non-null  float64
 5   onpromotion  1054944 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 167.8 MB

In [ ]:
retail